zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4100tp.svd
Kcomp = (SENSE_DIV+1)/(COMP_DIV+1)


Firmware Rule: It is expected that Kcomp be programmed as an integer. Anything else is considered a mis-programming.</description>
                <bitRange>[27:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC2_SHIFT</name>
                <description>N/A</description>
                <bitRange>[31:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SNS_CDAC_CTL</name>
            <description>Sensor CAPDAC Control</description>
            <addressOffset>0x1030</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF5FFFFFF</resetMask>
            <fields>
              <field>
                <name>SEL_RE</name>
                <description>Select value for Reference CAPDAC size.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_CO</name>
                <description>Select value for Compensation CAPDAC size.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SEL_CF</name>
                <description>Select value for Fine CAPDAC size.</description>
                <bitRange>[20:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FINE_MODE</name>
                <description>N/A</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>REFERENCE</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>COMPENSATION</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLOCK_REF_RATE</name>
                <description>N/A</description>
                <bitRange>[22:22]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CLK_MOD</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HALF_CLK_MOD</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FL_MODE</name>
                <description>Dither/Flatspot LFSR enable control.</description>
                <bitRange>[24:23]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DITHER</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OFFSET</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMP_BLANKING_EN</name>
                <description>Compensation blanking control. Type of blanking controlled by COMP_BLANKING_MODE.

The time window in which these effects apply depend on the following.

When enabled and in Direct Clock and Spread Spectrum mode (LFSR_MODE):

2-Phase:
50 percent Comp:
PH0: Enable Comp for (SENSE_DIV+1)/4 (this will be 0.5 of Ph0 phase)
PH1: Enable Comp for (SENSE_DIV+1)/4 (this will be 0.5 of Ph1 phase)
25 percent Comp:
PH0: Enable Comp for (SENSE_DIV+1)/8 (this will be 0.25 of Ph0 phase)
PH1: Enable Comp for (SENSE_DIV+1)/8 (this will be 0.25 of Ph1 phase)

4-Phase:
50 percent Comp:
PH1: Enable Comp for (SENSE_DIV+1)/4 (this will be Full of Ph1 phase)
PH3: Enable Comp for (SENSE_DIV+1)/4 (this will be Full of Ph3 phase)
25 percent Comp:
PH1: Enable Comp for (SENSE_DIV+1)/8 (this will be 0.5 of Ph1 phase)
PH3: Enable Comp for (SENSE_DIV+1)/8 (this will be 0.5 of Ph3 phase)

Note that in Spread Spectrum mode, if the ph* where compensation is on shrinks from the nominal. So, if we have 50 percent compensation the ph can shrink to be shorter than (SENSE_DIV+1)/4. So for example if ph1 shrinks, this will mean that compensation stays on a bit into ph2. This is OK.

When enabled and in PRS mode (LFSR_MODE):

2-Phase PRS:
50 percent Comp:
PH0: Enable Comp for (SENSE_DIV+1) (this will be 0.5 of AVG Ph0 and All of MIN Ph0)
PH1: Enable Comp for (SENSE_DIV+1) (this will be 0.5 of AVG Ph1 and All of MIN Ph1)
25 percent Comp:
PH0: Enable Comp for (SENSE_DIV+1)/2 (this will be 0.25 of AVG Ph0 and 0.5 of Min Ph0)
PH1: Enable Comp for (SENSE_DIV+1)/2 (this will be 0.25 of AVG Ph1 and 0.5 of Min Ph1)

4-Phase PRS:
50 percent Comp:
PH1: Enable Comp for (SENSE_DIV+1)*2 (this will be All of AVG Ph1 and 2x of Min Ph1 or All of Min Ph1+Min Ph2)
PH3: Enable Comp for (SENSE_DIV+1)*2 (this will be All of AVG Ph3 and 2x of Min Ph3 or All of Min Ph3+Min Ph0)
25 percent Comp:
PH1: Enable Comp for (SENSE_DIV+1) (this will be 0.5 of AVG Ph1 and All of Min Ph1)
PH3: Enable Comp for (SENSE_DIV+1) (this will be 0.5 of AVG Ph3 and All of Min Ph3)</description>
                <bitRange>[26:26]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LFSR_SCALE_FL</name>
                <description>N/A</description>
                <bitRange>[30:28]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MAX</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LFSR_SCALE_TYPE_FL</name>
                <description>N/A</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RIGHT</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEFT</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SNS_CTL</name>
            <description>Sense Control and Command Register</description>
            <addressOffset>0x1034</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xC000FE00</resetValue>
            <resetMask>0xFFFFFFF7</resetMask>
            <fields>
              <field>
                <name>START_SCAN</name>
                <description>Start the MSCLP sequencer scan process. The sequencer will clear this bit when it is done. Depending on the mode the sequencer is done when all NUM_SAMPLES for this scan have been accumulated, or if the sequencer is reset.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VALID</name>
                <description>N/A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LAST</name>
                <description>N/A</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MULTI_CH_MODE</name>
                <description>N/A</description>
                <bitRange>[5:4]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INTERNAL</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXTERNAL</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SENSE_MODE_SEL</name>
                <description>Sense mode register structure selection. This field allows quick change between registers that influence sense mode. This register selects which structure is currently 'live' and used by the IP.

