zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4100tp.svd
These registers are captured in MODE_STRUCT.</description>
                <bitRange>[7:6]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SENSE_MODE_0</name>
                    <description>Use MODE_STRUCT[0].</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SENSE_MODE_1</name>
                    <description>Use MODE_STRUCT[1].</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SENSE_MODE_2</name>
                    <description>Use MODE_STRUCT[2].</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SENSE_MODE_3</name>
                    <description>Use MODE_STRUCT[3].</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DECIM_RATE</name>
                <description>N/A</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SENSE_DIV</name>
                <description>N/A</description>
                <bitRange>[27:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LFSR_MODE</name>
                <description>N/A</description>
                <bitRange>[29:28]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DIRECT_CLOCK</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SPREAD_SPECTRUM</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRS</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LFSR_BITS</name>
                <description>N/A</description>
                <bitRange>[31:30]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2B</name>
                    <description>Use 2 bits: range = [-2,1]</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>3B</name>
                    <description>Use 3 bits: range = [-4,3]</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4B</name>
                    <description>Use 4 bits: range = [-8,7]</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>5B</name>
                    <description>Use 5 bits: range = [-16,15] (default)</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_FIFO_RD</name>
            <description>Result FIFO Pointer</description>
            <addressOffset>0x1200</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x377FFFF</resetMask>
            <fields>
              <field>
                <name>RAW_COUNT</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>OVERFLOW</name>
                <description>N/A</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CIC2_ACC_OVERFLOW</name>
                <description>N/A</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CIC2_SUBSAMPLE_COUNT_OVERFLOW</name>
                <description>N/A</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RESAMPLE_COUNT</name>
                <description>N/A</description>
                <bitRange>[22:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BAD_CONV_COUNT</name>
                <description>N/A</description>
                <bitRange>[25:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS1</name>
            <description>General Status Register 1</description>
            <addressOffset>0x1400</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RAW_COUNT</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RAW_COUNT_POS</name>
                <description>N/A</description>
                <bitRange>[31:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS2</name>
            <description>General Status Register 2</description>
            <addressOffset>0x1404</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DEBUG_CONV_COUNT</name>
                <description>N/A</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS3</name>
            <description>General Status Register 3</description>
            <addressOffset>0x1408</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x111F3FFF</resetMask>
            <fields>
              <field>
                <name>NUM_SUB_CONVS</name>
                <description>N/A</description>
                <bitRange>[13:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SEQ_STATE</name>
                <description>MSCLP Sequencer FSM state.</description>
                <bitRange>[20:16]</bitRange>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IDLE</name>
                    <description>N/A</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT_DMA_WRITE</name>
                    <description>N/A</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOAD_CONFIG</name>
                    <description>N/A</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT_SCAN_START</name>
                    <description>N/A</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ASSERT_RDY</name>
                    <description>N/A</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT_CONSENSUS</name>
                    <description>N/A</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INIT_CMOD</name>
                    <description>N/A</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>INIT_SHORT</name>
                    <description>N/A</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRO_OFFSET</name>
                    <description>N/A</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRO_DUMMY</name>
                    <description>N/A</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PRO_WAIT</name>
                    <description>N/A</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUB_CONV</name>
                    <description>N/A</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EPILOGUE</name>
                    <description>N/A</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT_DMA_READ_NEW_SAMPLE</name>
                    <description>N/A</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT_DMA_READ_EOF</name>
                    <description>N/A</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POST_SCAN</name>
                    <description>N/A</description>
                    <value>15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POST_EPI</name>
                    <description>N/A</description>
                    <value>16</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FS_CLOCK</name>
                <description>N/A</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>MSC_CMP_OUT</name>
                <description>N/A</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS4</name>
            <description>General Status Register 4</description>
            <addressOffset>0x140C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FF</resetMask>
            <fields>
              <field>
                <name>NUM_CIC2_SUB_SAMPLES</name>
                <description>N/A</description>
                <bitRange>[8:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_FIFO_STATUS</name>
            <description>Result FIFO Status</description>
            <addressOffset>0x1410</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF07FF</resetMask>
            <fields>
              <field>
                <name>USED</name>
                <description>N/A</description>
                <bitRange>[10:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SCAN_IDX</name>
                <description>N/A</description>
                <bitRange>[25:16]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_FIFO_STATUS2</name>
            <description>Result FIFO Status 2</description>
            <addressOffset>0x1414</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC3FF03FF</resetMask>
            <fields>
              <field>
                <name>WR_PTR</name>
                <description>N/A</description>
                <bitRange>[9:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_PTR</name>
                <description>N/A</description>
                <bitRange>[25:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FIFO_UNDERFLOW</name>
                <description>N/A</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>FIFO_OVERFLOW</name>
                <description>N/A</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CE_STATUS</name>
            <description>Channel Engine Status</description>
            <addressOffset>0x1418</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x131FFFF</resetMask>
            <fields>
              <field>
                <name>BL_DELTA</name>
                <description>N/A</description>
                <bitRange>[16:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BL_STATE</name>
                <description>N/A</description>
                <bitRange>[21:20]</bitRange>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>INIT</name>
                    <description>Initialise baseline to raw count.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UPDATE_SLOW</name>
                    <description>Slow baseline update when raw count minus baseline exceeds sensor noise threshold.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UPDATE_FAST</name>
                    <description>Fast baseline update when baseline minus raw count exceeds sensor negative noise threshold.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIG_STATE</name>
                <description>N/A</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BRIDGE_STATUS</name>
            <description>AHB2AHB Bridge Status</description>
            <addressOffset>0x141C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x1</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>READY</name>
                <description>N/A</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FRAME_CMD</name>
            <description>Frame Command Register</description>
            <addressOffset>0x1800</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>START_FRAME</name>
                <description>Start the MSCLP sequencer frame process. Note that a rising edge on this bit also creates a 4x cycle clk_msc pulse on the msc_ext_frm_start_out signal (when EXT_FRAME_START_MODE = DISABLED). The corresponding msc_ext_frm_start_out_en is controlled by CTL.ENABLED.

Sequencer FSM clears this bit on egress from IDLE. If START_FRAME is set by firmware when FSM is not in IDLE, the hardware must hold the bit set to allow for 'pending' frame behaviour.

